garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1718.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1DBF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0x3f" edc:name="G1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF4" edc:desc="" edc:mask="0x1" edc:name="G1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF5" edc:desc="" edc:mask="0x1" edc:name="G1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG1CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG1CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x697">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1MD" edc:desc="" edc:mask="0x7" edc:name="G1MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x3" edc:name="G1CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1LD" edc:desc="" edc:mask="0x1" edc:name="G1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1MD0" edc:desc="" edc:mask="0x1" edc:name="G1MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD1" edc:desc="" edc:mask="0x1" edc:name="G1MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD2" edc:desc="" edc:mask="0x1" edc:name="G1MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS1" edc:desc="" edc:mask="0x1" edc:name="G1CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG1CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG1CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x698">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POLA" edc:desc="" edc:mask="0x1" edc:name="G1POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLB" edc:desc="" edc:mask="0x1" edc:name="G1POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLC" edc:desc="" edc:mask="0x1" edc:name="G1POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLD" edc:desc="" edc:mask="0x1" edc:name="G1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1FDBS" edc:desc="" edc:mask="0x1" edc:name="G1FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RDBS" edc:desc="" edc:mask="0x1" edc:name="G1RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x699">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1RIS0" edc:desc="" edc:mask="0x1" edc:name="G1RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS1" edc:desc="" edc:mask="0x1" edc:name="G1RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS2" edc:desc="" edc:mask="0x1" edc:name="G1RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS3" edc:desc="" edc:mask="0x1" edc:name="G1RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS4" edc:desc="" edc:mask="0x1" edc:name="G1RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS5" edc:desc="" edc:mask="0x1" edc:name="G1RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS6" edc:desc="" edc:mask="0x1" edc:name="G1RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS7" edc:desc="" edc:mask="0x1" edc:name="G1RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1RSIM0" edc:desc="" edc:mask="0x1" edc:name="G1RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM1" edc:desc="" edc:mask="0x1" edc:name="G1RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM2" edc:desc="" edc:mask="0x1" edc:name="G1RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM3" edc:desc="" edc:mask="0x1" edc:name="G1RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM4" edc:desc="" edc:mask="0x1" edc:name="G1RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM5" edc:desc="" edc:mask="0x1" edc:name="G1RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM6" edc:desc="" edc:mask="0x1" edc:name="G1RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM7" edc:desc="" edc:mask="0x1" edc:name="G1RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1FIS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1FIS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1FIS0" edc:desc="" edc:mask="0x1" edc:name="G1FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS1" edc:desc="" edc:mask="0x1" edc:name="G1FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS2" edc:desc="" edc:mask="0x1" edc:name="G1FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS3" edc:desc="" edc:mask="0x1" edc:name="G1FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS4" edc:desc="" edc:mask="0x1" edc:name="G1FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS5" edc:desc="" edc:mask="0x1" edc:name="G1FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS6" edc:desc="" edc:mask="0x1" edc:name="G1FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIS7" edc:desc="" edc:mask="0x1" edc:name="G1FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1FSIM" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1FSIM" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1FSIM0" edc:desc="" edc:mask="0x1" edc:name="G1FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM1" edc:desc="" edc:mask="0x1" edc:name="G1FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM2" edc:desc="" edc:mask="0x1" edc:name="G1FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM3" edc:desc="" edc:mask="0x1" edc:name="G1FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM4" edc:desc="" edc:mask="0x1" edc:name="G1FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM5" edc:desc="" edc:mask="0x1" edc:name="G1FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM6" edc:desc="" edc:mask="0x1" edc:name="G1FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM7" edc:desc="" edc:mask="0x1" edc:name="G1FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="COG1ASD0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="COG1ASD0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC" edc:desc="" edc:mask="0x3" edc:name="G1ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD" edc:desc="" edc:mask="0x3" edc:name="G1ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ARSEN" edc:desc="" edc:mask="0x1" edc:name="G1ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASE" edc:desc="" edc:mask="0x1" edc:name="G1ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC0" edc:desc="" edc:mask="0x1" edc:name="G1ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC1" edc:desc="" edc:mask="0x1" edc:name="G1ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD0" edc:desc="" edc:mask="0x1" edc:name="G1ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD1" edc:desc="" edc:mask="0x1" edc:name="G1ASDBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="COG1ASD1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="COG1ASD1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1AS0E" edc:desc="" edc:mask="0x1" edc:name="G1AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS1E" edc:desc="" edc:mask="0x1" edc:name="G1AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS2E" edc:desc="" edc:mask="0x1" edc:name="G1AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS3E" edc:desc="" edc:mask="0x1" edc:name="G1AS3E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x69F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1STRA" edc:desc="" edc:mask="0x1" edc:name="G1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRB" edc:desc="" edc:mask="0x1" edc:name="G1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRC" edc:desc="" edc:mask="0x1" edc:name="G1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRD" edc:desc="" edc:mask="0x1" edc:name="G1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATA" edc:desc="" edc:mask="0x1" edc:name="G1SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATB" edc:desc="" edc:mask="0x1" edc:name="G1SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATC" edc:desc="" edc:mask="0x1" edc:name="G1SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATD" edc:desc="" edc:mask="0x1" edc:name="G1SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xda0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe70" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xE0C"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xE0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:desc="" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INTPPS" edc:nzwidth="8" edc:por="---01000" edc:_addr="0xE10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPPS" edc:desc="" edc:mask="0x1f" edc:name="INTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
